#w3_課堂練習
#綜合運用至目前所學的: 基本運算, 變數, 數值, 字串, 比較...
#自行規劃一個議題及問題
#以"課堂練習範本"word檔格式繳交至Moodle
#------
#以下僅是簡單概念，請同學舉一反三，發揮創意進行規劃設計
#e.g.規劃情境：雖然政府開放泡泡旅行，但阿義還是怕死不敢出國，於是他就想到好友阿花，準備藉由他在國外代購
#e.g.定義問題：可能要知道自己的預算夠不夠、幣別換算問題、夠想買的項目、不夠少買的項目
#e.g.程式碼：
#------
東西1 = '陽傘'
東西2 = '帽子' 
東西3 = '拖鞋'
東西1價格 = 200
東西2價格 = 250
東西3價格 = 400
預算 = 600

#要買哪些東西及價格
print("要買哪些東西及價格")
print(東西1,'的價格:',東西1價格)
print(東西2,'的價格:',東西2價格)
print(東西3,'的價格:',東西3價格)

#做預算和要買東西的總價的比較
總價 = 東西1價格 + 東西2價格 + 東西3價格
print("總價:", 總價)

#比較
print(總價 > 預算)

#結果詮釋：預算不足，少買幾樣

